In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser = Series(np.arange(3), index=['A','B','C'])

In [3]:
ser=ser*4

In [4]:
ser

A    0
B    4
C    8
dtype: int64

In [5]:
ser['B']

4

In [6]:
ser[1]

/var/folders/4y/p5wbs2392ng1qdh47g8kk6x00000gn/T/ipykernel_6504/4267038266.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[1]

4

In [7]:
ser[0:3]

A    0
B    4
C    8
dtype: int64

In [12]:
ser[ser>3]>8

B    False
C    False
dtype: bool

In [15]:
ser[ser>3]=4

In [16]:
ser

A    0
B    4
C    4
dtype: int64

In [18]:
dframe1 = DataFrame(np.arange(25).reshape(5,5),['SF','LA','NY','NZ','AUS'],columns=['A','B','C','D','E'])

In [19]:
dframe1

      A   B   C   D   E
SF    0   1   2   3   4
LA    5   6   7   8   9
NY   10  11  12  13  14
NZ   15  16  17  18  19
AUS  20  21  22  23  24

In [23]:
dframe1[dframe1['C']>5]

      A   B   C   D   E
LA    5   6   7   8   9
NY   10  11  12  13  14
NZ   15  16  17  18  19
AUS  20  21  22  23  24

In [28]:
dframe1[dframe1['C']==7]

    A  B  C  D  E
LA  5  6  7  8  9

In [30]:
dframe1['C']*4

SF      8
LA     28
NY     48
NZ     68
AUS    88
Name: C, dtype: int64

In [31]:
dframe1

      A   B   C   D   E
SF    0   1   2   3   4
LA    5   6   7   8   9
NY   10  11  12  13  14
NZ   15  16  17  18  19
AUS  20  21  22  23  24

In [33]:
dframe1>10

         A      B      C      D      E
SF   False  False  False  False  False
LA   False  False  False  False  False
NY   False   True   True   True   True
NZ    True   True   True   True   True
AUS   True   True   True   True   True

In [37]:
dframe1.iloc[4]

A    20
B    21
C    22
D    23
E    24
Name: AUS, dtype: int64

In [42]:
dframe1.iloc[1,1:-1]

B    6
C    7
D    8
Name: LA, dtype: int64